ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/pio/pic32cx2051mtg100.h
#define PIO_PB12A_SEG15        (1u << 12) /**< \brief Slcdc signal: SEG15 */
#define PIO_PB13A_SEG16        (1u << 13) /**< \brief Slcdc signal: SEG16 */
#define PIO_PB14A_SEG17        (1u << 14) /**< \brief Slcdc signal: SEG17 */
#define PIO_PB15A_SEG18        (1u << 15) /**< \brief Slcdc signal: SEG18 */
#define PIO_PB16A_SEG19        (1u << 16) /**< \brief Slcdc signal: SEG19 */
#define PIO_PA31A_SEG2         (1u << 31) /**< \brief Slcdc signal: SEG2 */
#define PIO_PB17A_SEG20        (1u << 17) /**< \brief Slcdc signal: SEG20 */
#define PIO_PB18A_SEG21        (1u << 18) /**< \brief Slcdc signal: SEG21 */
#define PIO_PB19A_SEG22        (1u << 19) /**< \brief Slcdc signal: SEG22 */
#define PIO_PB20A_SEG23        (1u << 20) /**< \brief Slcdc signal: SEG23 */
#define PIO_PB21A_SEG24        (1u << 21) /**< \brief Slcdc signal: SEG24 */
#define PIO_PB22A_SEG25        (1u << 22) /**< \brief Slcdc signal: SEG25 */
#define PIO_PB23A_SEG26        (1u << 23) /**< \brief Slcdc signal: SEG26 */
#define PIO_PB24A_SEG27        (1u << 24) /**< \brief Slcdc signal: SEG27 */
#define PIO_PB25A_SEG28        (1u << 25) /**< \brief Slcdc signal: SEG28 */
#define PIO_PB26A_SEG29        (1u << 26) /**< \brief Slcdc signal: SEG29 */
#define PIO_PB0A_SEG3          (1u << 0)  /**< \brief Slcdc signal: SEG3 */
#define PIO_PC0A_SEG30         (1u << 0)  /**< \brief Slcdc signal: SEG30 */
#define PIO_PC1A_SEG31         (1u << 1)  /**< \brief Slcdc signal: SEG31 */
#define PIO_PB1A_SEG4          (1u << 1)  /**< \brief Slcdc signal: SEG4 */
#define PIO_PB2A_SEG5          (1u << 2)  /**< \brief Slcdc signal: SEG5 */
#define PIO_PB3A_SEG6          (1u << 3)  /**< \brief Slcdc signal: SEG6 */
#define PIO_PB4A_SEG7          (1u << 4)  /**< \brief Slcdc signal: SEG7 */
#define PIO_PB5A_SEG8          (1u << 5)  /**< \brief Slcdc signal: SEG8 */
#define PIO_PB6A_SEG9          (1u << 6)  /**< \brief Slcdc signal: SEG9 */
/* ========== Pio definition for TC0 peripheral ========== */
#define PIO_PA23D_TCLK0        (1u << 23) /**< \brief Tc0 signal: TCLK0 */
#define PIO_PB1D_TCLK1         (1u << 1)  /**< \brief Tc0 signal: TCLK1 */
#define PIO_PB4D_TCLK2         (1u << 4)  /**< \brief Tc0 signal: TCLK2 */
#define PIO_PA2B_TIOA0         (1u << 2)  /**< \brief Tc0 signal: TIOA0 */
#define PIO_PA25D_TIOA0        (1u << 25) /**< \brief Tc0 signal: TIOA0 */
#define PIO_PA31D_TIOA1        (1u << 31) /**< \brief Tc0 signal: TIOA1 */
#define PIO_PB2D_TIOA2         (1u << 2)  /**< \brief Tc0 signal: TIOA2 */
#define PIO_PA3A_TIOB0         (1u << 3)  /**< \brief Tc0 signal: TIOB0 */
#define PIO_PA24D_TIOB0        (1u << 24) /**< \brief Tc0 signal: TIOB0 */
#define PIO_PB0D_TIOB1         (1u << 0)  /**< \brief Tc0 signal: TIOB1 */
#define PIO_PB3D_TIOB2         (1u << 3)  /**< \brief Tc0 signal: TIOB2 */
/* ========== Pio definition for TC1 peripheral ========== */
#define PIO_PB14C_TCLK3        (1u << 14) /**< \brief Tc1 signal: TCLK3 */
#define PIO_PB17C_TCLK4        (1u << 17) /**< \brief Tc1 signal: TCLK4 */
#define PIO_PC5D_TCLK5         (1u << 5)  /**< \brief Tc1 signal: TCLK5 */
#define PIO_PB8C_TIOA3         (1u << 8)  /**< \brief Tc1 signal: TIOA3 */
#define PIO_PC0C_TIOA3         (1u << 0)  /**< \brief Tc1 signal: TIOA3 */
#define PIO_PB18C_TIOA4        (1u << 18) /**< \brief Tc1 signal: TIOA4 */
#define PIO_PB5C_TIOA5         (1u << 5)  /**< \brief Tc1 signal: TIOA5 */
#define PIO_PB24C_TIOA5        (1u << 24) /**< \brief Tc1 signal: TIOA5 */
#define PIO_PB13C_TIOB3        (1u << 13) /**< \brief Tc1 signal: TIOB3 */
#define PIO_PB19C_TIOB4        (1u << 19) /**< \brief Tc1 signal: TIOB4 */
#define PIO_PB6C_TIOB5         (1u << 6)  /**< \brief Tc1 signal: TIOB5 */
#define PIO_PB25C_TIOB5        (1u << 25) /**< \brief Tc1 signal: TIOB5 */
/* ========== Pio definition for TC2 peripheral ========== */
#define PIO_PA10C_TCLK6        (1u << 10) /**< \brief Tc2 signal: TCLK6 */
#define PIO_PC16D_TCLK7        (1u << 16) /**< \brief Tc2 signal: TCLK7 */
#define PIO_PC19D_TCLK8        (1u << 19) /**< \brief Tc2 signal: TCLK8 */
#define PIO_PA6C_TIOA6         (1u << 6)  /**< \brief Tc2 signal: TIOA6 */
#define PIO_PC14D_TIOA7        (1u << 14) /**< \brief Tc2 signal: TIOA7 */
#define PIO_PC17D_TIOA8        (1u << 17) /**< \brief Tc2 signal: TIOA8 */
#define PIO_PA7C_TIOB6         (1u << 7)  /**< \brief Tc2 signal: TIOB6 */
#define PIO_PC15D_TIOB7        (1u << 15) /**< \brief Tc2 signal: TIOB7 */
#define PIO_PC18D_TIOB8        (1u << 18) /**< \brief Tc2 signal: TIOB8 */
/* ========== Pio definition for TC3 peripheral ========== */
#define PIO_PD16A_TCLK10       (1u << 16) /**< \brief Tc3 signal: TCLK10 */
#define PIO_PD19C_TCLK11       (1u << 19) /**< \brief Tc3 signal: TCLK11 */
#define PIO_PD3A_TCLK9         (1u << 3)  /**< \brief Tc3 signal: TCLK9 */
#define PIO_PD14A_TIOA10       (1u << 14) /**< \brief Tc3 signal: TIOA10 */
#define PIO_PD17C_TIOA11       (1u << 17) /**< \brief Tc3 signal: TIOA11 */
#define PIO_PD0A_TIOA9         (1u << 0)  /**< \brief Tc3 signal: TIOA9 */
#define PIO_PD15A_TIOB10       (1u << 15) /**< \brief Tc3 signal: TIOB10 */
#define PIO_PD18C_TIOB11       (1u << 18) /**< \brief Tc3 signal: TIOB11 */
#define PIO_PD4A_TIOB9         (1u << 4)  /**< \brief Tc3 signal: TIOB9 */
/* ========== Pio definition for UART peripheral ========== */
#define PIO_PD1A_URXD          (1u << 1)  /**< \brief Uart signal: URXD */
#define PIO_PD12A_URXD         (1u << 12) /**< \brief Uart signal: URXD */
#define PIO_PD2A_UTXD          (1u << 2)  /**< \brief Uart signal: UTXD */
#define PIO_PD13A_UTXD         (1u << 13) /**< \brief Uart signal: UTXD */
/* ========== Pio indexes ========== */
#define PIO_PA0_IDX            0
#define PIO_PA1_IDX            1
#define PIO_PA4_IDX            4
#define PIO_PA5_IDX            5
#define PIO_PA6_IDX            6
#define PIO_PA7_IDX            7
#define PIO_PA8_IDX            8
#define PIO_PA9_IDX            9
#define PIO_PA12_IDX           12
#define PIO_PA13_IDX           13
#define PIO_PA14_IDX           14
#define PIO_PA15_IDX           15
#define PIO_PA21_IDX           21
#define PIO_PA22_IDX           22
#define PIO_PA23_IDX           23
#define PIO_PA24_IDX           24
#define PIO_PA25_IDX           25
#define PIO_PA26_IDX           26
#define PIO_PA27_IDX           27
#define PIO_PA28_IDX           28
#define PIO_PA29_IDX           29
#define PIO_PA30_IDX           30
#define PIO_PA31_IDX           31
#define PIO_PB0_IDX            32
#define PIO_PB1_IDX            33
#define PIO_PB2_IDX            34
#define PIO_PB3_IDX            35
#define PIO_PB4_IDX            36
#define PIO_PB5_IDX            37
#define PIO_PB6_IDX            38
#define PIO_PB7_IDX            39
#define PIO_PB8_IDX            40
#define PIO_PB9_IDX            41
#define PIO_PB10_IDX           42
#define PIO_PB11_IDX           43
#define PIO_PB12_IDX           44
#define PIO_PB18_IDX           50
#define PIO_PB19_IDX           51
#define PIO_PB20_IDX           52
#define PIO_PB21_IDX           53
#define PIO_PB22_IDX           54
#define PIO_PB23_IDX           55
#define PIO_PB24_IDX           56
#define PIO_PB25_IDX           57
#define PIO_PB26_IDX           58
#define PIO_PC0_IDX            64
#define PIO_PC2_IDX            66
#define PIO_PC3_IDX            67
#define PIO_PC4_IDX            68
#define PIO_PC5_IDX            69
#define PIO_PC6_IDX            70
#define PIO_PC7_IDX            71
#define PIO_PC10_IDX           74
#define PIO_PC11_IDX           75
#define PIO_PC12_IDX           76
#define PIO_PC13_IDX           77
#define PIO_PC14_IDX           78
#define PIO_PC15_IDX           79
#define PIO_PC22_IDX           86
#define PIO_PD0_IDX            96
#define PIO_PD1_IDX            97
#define PIO_PD2_IDX            98
#define PIO_PD4_IDX            100
#define PIO_PD5_IDX            101
#define PIO_PD6_IDX            102
#define PIO_PD7_IDX            103
#define PIO_PD8_IDX            104
#define PIO_PD9_IDX            105
#define PIO_PD10_IDX           106
#define PIO_PD11_IDX           107
#define PIO_PD14_IDX           110
#define PIO_PD15_IDX           111
#define PIO_PD16_IDX           112
#define PIO_PD17_IDX           113
#define PIO_PD18_IDX           114
#define PIO_PD19_IDX           115

#endif /* _PIC32CX2051MTG100_PIO_ */
